---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IFCGuidKey Properties
IFCGuidKey Class See Also Send Feedback
---

The IFCGuidKey type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IFCGlobalId | IFC GlobalId for map. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

IFCGuidKey Class

Autodesk.Revit.DB.IFC Namespace